In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import series,DataFrame

ImportError: cannot import name 'series' from 'pandas' (C:\ProgramData\anaconda3\Lib\site-packages\pandas\__init__.py)

In [3]:
from pandas import Series,DataFrame

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj2 = pd.Series([4,7,-5,3]),index=(["d","b","a","c"])

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1604577102.py, line 1)

In [8]:
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])

SyntaxError: incomplete input (2067961676.py, line 1)

In [8]:
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])

SyntaxError: incomplete input (2067961676.py, line 1)

In [9]:
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
obj2["a"]

-5

In [13]:
obj2["d"] = 6

In [14]:
obj2[["c","a","d"]]

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj*2

0     8
1    14
2   -10
3     6
dtype: int64

In [17]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
"b" in obj2

True

In [20]:
"e" in obj2

False

In [21]:
sdata = {"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}

In [22]:
obj3 = Series(sdata)

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
sdata_2 = obj3.to_dict()

In [26]:
sdata_2

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [27]:
states = ["California","Ohio","Oregon","Texas"]

In [28]:
obj4 = pd.Series(Sdata,index = states)

NameError: name 'Sdata' is not defined

In [29]:
obj4 = pd.Series(sdata,index = states)

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [32]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [35]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [36]:
obj4.name = "population"

In [37]:
obj4.index.name="state"

In [38]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [39]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [40]:
obj.index = ["Bob","Steve","Jeff","Ryan"]

In [41]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [42]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000,2001,2002,2001,2002,2003],
        "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}

In [43]:
frame = pd.DataFrame(data)

In [44]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [46]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [47]:
pd.DataFrame(data,columns=["years","state","pop"])

  years   state  pop
0   NaN    Ohio  1.5
1   NaN    Ohio  1.7
2   NaN    Ohio  3.6
3   NaN  Nevada  2.4
4   NaN  Nevada  2.9
5   NaN  Nevada  3.2

In [48]:
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"])

In [49]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [50]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [51]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [52]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [53]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [54]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [55]:
frame2["debt"]=16.5

In [56]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [57]:
frame2["eastern"] = frame["state"] == Ohio

NameError: name 'Ohio' is not defined

In [58]:
frame2["eastern"] = frame["state"] == "Ohio"

In [59]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5  16.5     True
1  2001    Ohio  1.7  16.5     True
2  2002    Ohio  3.6  16.5     True
3  2001  Nevada  2.4  16.5    False
4  2002  Nevada  2.9  16.5    False
5  2003  Nevada  3.2  16.5    False

In [60]:
del frame2["eastern"]

In [61]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [62]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [63]:
populations = {"Ohio":{2000:1.5,2001:1.7,2002:3.6},
               "Nevada":{2001:2.4,2002:2.9}}

In [64]:
frame3 = pd.DataFrame(populations)

In [65]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [66]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [67]:
frame2["debt"] = np.arange(6.)

In [68]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [69]:
val = pd.Series([-1.2,-1.5,-1.7],index = ["two","four","five"])

In [70]:
frame2["debt"] = val

In [71]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [72]:
frame2["eastern"] = frame2["states"] == "Ohio"

KeyError: 'states'

In [73]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [74]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [75]:
del frame2["eastern"]

In [76]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [77]:
pd.DataFrame(populations,index = [2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [78]:
pdata = {"Ohio":frame3["Ohio"][:-1],
         "Navada":frame3["Navada"][:;-1]}

SyntaxError: invalid syntax (945294329.py, line 2)

In [79]:
pdata = {"Ohio":frame3["Ohio"][:-1],
         "Navada":frame3["Navada"][:-1]}

KeyError: 'Navada'

In [80]:
pdata = {"Ohio":frame3["Ohio"][:-1],
         "Nevada":frame3["Nevada"][:-1]}

In [81]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64,
 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [82]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [83]:
frame3.index.name = "year"

In [84]:
frame3.columns.name ="state"

In [85]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [86]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [87]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [88]:
obj = pd.Series(np.arange(3),index=['a','b','c'])

In [89]:
obj

a    0
b    1
c    2
dtype: int32

In [90]:
index = obj.index

In [91]:
index

Index(['a', 'b', 'c'], dtype='object')

In [92]:
index[1]='d'

TypeError: Index does not support mutable operations

In [93]:
labels = pd.Index(np.arange(3))

In [94]:
labels

Index([0, 1, 2], dtype='int32')

In [95]:
obj2 = pd.Series([-1.5,-2.5,0],index=labels)

In [96]:
obj2

0   -1.5
1   -2.5
2    0.0
dtype: float64

In [97]:
obj2.index is labels

True

In [98]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [99]:
frame3.column

AttributeError: 'DataFrame' object has no attribute 'column'

In [100]:
frame3.columns"

SyntaxError: unterminated string literal (detected at line 1) (4276590304.py, line 1)

In [101]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [ ]:
index1 = frame3.index
index2